Revit 2024 API
RoutingConditions Properties
The RoutingConditions type exposes the following members.
Properties
Name | Description
ErrorLevel
 The error level that the routing preference manager should post errors if the routing conditions do not meet any routing preference rule, could be None, Warning, or Error
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PreferredJunctionType
 The junction type (Tee or Tap) to select if defined fittings of both junction types meet all routing conditions.
See Also
RoutingConditions Class
Autodesk.Revit.DB Namespace